In [7]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\202-026\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\202-026\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\202-026\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\202-026\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\202-026\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\202-026\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [17]:
import pandas as pd

In [23]:
data= {"name":["nick", "judy", "alex"],
       "age":[10, 15, 20]}
df = pd.DataFrame(data)
data
df

   name  age
0  nick   10
1  judy   15
2  alex   20

In [25]:
df['age_plus'] = df['age'] + 1
df['age_squared'] = df['age'] * df['age']
df

   name  age  age_plus  age_squared
0  nick   10        11          100
1  judy   15        16          225
2  alex   20        21          400

## join 가능

In [35]:
df2 = pd.DataFrame({  "name" : ["nick", "judy", "alex"]
                    , "height" : [180, 165, 175]
                    , "gender" : ["M", "F", "M"]})
joined = df.set_index("name").join(df2.set_index("name"))
joined

      age  age_plus  age_squared  height gender
name
nick   10        11          100     180      M
judy   15        16          225     165      F
alex   20        21          400     175      M

## group by 가능

In [37]:
df_mean = joined.groupby("gender").mean()

         age  age_plus  age_squared  height
gender
F       15.0      16.0        225.0   165.0
M       15.0      16.0        250.0   177.5

## 금융 데이터를 쉽게 다운로드하고 처리할 수 있도록 도와주는 라이브러리.
-주식, 지수, 환울, 암호화폐 등 다양하 데이터를 제공함.

In [43]:
import FinanceDataReader as fdr

ModuleNotFoundError: No module named 'FinanceDataReader'